In [1]:
import pandas as pd

In [2]:
d=pd.read_csv(r"E:\xlsx\resultuber.csv")

In [3]:
d

,Unnamed: 0,key,fare_amount,passenger_count,year,time,month
0,0,2015-05-07 19:52:06.0000003,7.5,1,2015,19,5
1,1,2009-07-17 20:04:56.0000002,7.7,1,2009,20,7
2,2,2009-08-24 21:45:00.00000061,12.9,1,2009,21,8
3,3,2009-06-26 08:22:21.0000001,5.3,3,2009,8,6
4,4,2014-08-28 17:47:00.000000188,16.0,5,2014,17,8
...,...,...,...,...,...,...,...
199995,199995,2012-10-28 10:49:00.00000053,3.0,1,2012,10,10
199996,199996,2014-03-14 01:09:00.0000008,7.5,1,2014,1,3
199997,199997,2009-06-29 00:42:00.00000078,30.9,2,2009,0,6
199998,199998,2015-05-20 14:56:25.0000004,14.5,1,2015,14,5
199999,199999,2010-05-15 04:08:00.00000076,14.1,1,2010,4,5